export const offices = [
    {
        address: '143420, Москва, Московская обл., г.о. Красногорск, пос. Архангельское, тер. Музей техники, стр.8, офис 618',
        legal_address: 'Здесь Юр.Адрес: Москва, Московская обл., г.о. Красногорск, пос. Архангельское, тер. Музей техники, стр.8',
        director: 'Рыжов Сергей Александрович',
        tel: '+7(965) 123-00-47',
        email: 'info@trasko.ru',
        foundation: 'дата_основания',
        name: 'Москва',
        coord: [55.79614314545524, 37.297590308663324]
    },
    {
        address: '400001, Волгоградская обл., Волгоград, ул. Канунникова, д. 23, офис 4-05',
        legal_address: 'юр.адрес',
        director: 'Вулова Валерия Владимировна',
        tel: '+7(965) 123-00-47',
        email: 'info@trasko.ru',
        foundation: 'дата_основания',
        name: 'Волгоград',
        coord: [48.70271060279138, 44.49794349140154]
    },
    {
        address: '143420, Омская обл., Омск, ул. Маршала Жукова, д.72, офис 305',
        legal_address: 'юр.адрес',
        director: 'Белова Татьяна Владимировна',
        tel: '+7(965) 123-00-47',
        email: 'info@trasko.ru',
        foundation: 'дата_основания',
        name: 'Омск',
        coord: [54.975279810116575, 73.38797672883607]
    },
    {
        address: '394018, Воронежская обл., Воронеж, ул. Куцыгина, д.32, ДЦ ИКАР, офис 412',
        legal_address: 'юр.адрес',
        director: 'Антохин Антон Игоревич',
        tel: '+7(965) 123-00-47',
        email: 'info@trasko.ru',
        foundation: 'дата_основания',
        name: 'Воронеж',
        coord: [51.66210487714528, 39.183909419791405]
    },
    {
        address: '620100, Свердловская обл., Екатеринбург, Сибирский тр-т, д. 12/2, офис 208',
        legal_address: 'юр.адрес',
        director: 'Хаменко Максим Анатольевич',
        tel: '+7(965) 123-00-47',
        email: 'info@trasko.ru',
        foundation: 'дата_основания',
        name: 'Екатеринбург',
        coord: [56.82080906787587, 60.650474999999965]
    },
    {
        address: '454080, Челябинская обл., Челябинск, пр-т Ленина, д. 89, офис 319-320',
        legal_address: 'юр.адрес',
        director: 'Свинцов Евгений Владиславович',
        tel: '+7(965) 123-00-47',
        email: 'info@trasko.ru',
        foundation: 'дата_основания',
        name: 'Челябинск',
        coord: [55.158206963320296, 61.364005814819315]
    },
    {
        address: '603028, Нижегородская обл., Нижний Новгород, Базовый пр-д, д.2а, пом.4',
        legal_address: 'юр.адрес',
        director: 'Быстрякова Наталья Николаевна',
        tel: '+7(965) 123-00-47',
        email: 'info@trasko.ru',
        foundation: 'дата_основания',
        name: 'Нижний Новгород',
        coord: [56.31077970532737, 43.86706638095091]
    },
    {
        address: '630024, Новосибирская обл., Новосибирск, ул. Мира, д. 58, офис 1',
        legal_address: 'юр.адрес',
        director: 'Кулеба Мария Владимировна',
        tel: '+7(965) 123-00-47',
        email: 'info@trasko.ru',
        foundation: 'дата_основания',
        name: 'Новосибирск',
        coord: [54.962519703578415, 82.92698167196656],
    },
    {
        address: '614000, Пермский край, Пермь, ул. Луначарского, д.73',
        legal_address: 'юр.адрес',
        director: 'Киевских Денис Владимирович',
        tel: '+7(965) 123-00-47',
        email: 'info@trasko.ru',
        foundation: 'дата_основания',
        name: 'Пермь',
        coord: [58.007421991558644, 56.24086466931147]
    },
    {
        address: '150040, г. Ярославль, ул. Свердлова, д. 25 Д, 4 этаж',
        legal_address: 'юр.адрес',
        director: 'Большова Екатерина Сергеевна',
        tel: '+7(965) 123-00-47',
        email: 'info@trasko.ru',
        foundation: 'дата_основания',
        name: 'Ярославль',
        coord: [57.63032591405208, 39.87096222883597]
    },
    {
        address: '450098, Республика Башкортостан, Уфа, ул. Комсомольская, д. 165/3, офисы: 902, 904',
        legal_address: 'юр.адрес',
        director: 'Валийская Гузелия Раифовна',
        tel: '+7(965) 123-00-47',
        email: 'info@trasko.ru',
        foundation: 'дата_основания',
        name: 'Уфа',
        coord: [54.766401569901035, 56.02680149999996]
    },
    {
        address: '443125, Самарская обл., Самара, ул. Губанова, д. 3',
        legal_address: 'юр.адрес',
        director: 'Курамов Станислав Николаевич',
        tel: '+7(965) 123-00-47',
        email: 'info@trasko.ru',
        foundation: 'дата_основания',
        name: 'Самара',
        coord: [53.24940807116889, 50.21404550000001]
    },
    {
        address: '664053, Иркутская обл., Иркутск, ул. Розы Люксембург, д. 218, офис 201',
        legal_address: 'юр.адрес',
        director: 'Карандаш Леонид Алексеевич',
        tel: '+7(965) 123-00-47',
        email: 'info@trasko.ru',
        foundation: 'дата_основания',
        name: 'Иркутск',
        coord: [52.36293004556033, 104.13135789794197]
    },
    {
        address: '143420, Ижевск, ул. Ворошилова, д. 109а, офис 412',
        legal_address: 'юр.адрес',
        director: 'Крестцов Денис Владимирович',
        tel: '+7(965) 123-00-47',
        email: 'info@trasko.ru',
        foundation: 'дата_основания',
        name: 'Ижевск',
        coord: [56.875821567806014, 53.281908999999985]
    },
    {
        address: '423602, Елабуга, ул. Баки Урманче, д. 36А',
        legal_address: 'юр.адрес',
        director: 'Большевицкий Наиль Ринатович',
        tel: '+7(965) 123-00-47',
        email: 'info@trasko.ru',
        foundation: 'дата_основания',
        name: 'Елабуга',
        coord: [55.7783646070123, 52.02590233596794]
    },
    {
        address: '420044, Казань, пр-т Хусаина Ямашева, д. 36/3, офис 10-05',
        legal_address: 'юр.адрес',
        director: 'Лупин Антон Николаевич',
        tel: '+7(965) 123-00-47',
        email: 'info@trasko.ru',
        foundation: 'дата_основания',
        name: 'Казань',
        coord: [55.827818068923385, 49.10355749999991]
    },
    {
        address: '220083, Минск, пр-т Дзержинского 104, офис 802Б',
        legal_address: 'юр.адрес',
        director: 'Нестерова Людмила',
        tel: '+7(965) 123-00-47',
        email: 'info@trasko.ru',
        foundation: 'дата_основания',
        name: 'Минск',
        coord: [53.860623180184476, 27.47893937829586]
    },
    {
        address: '00-872, Варшава, Варшава, ул.Хлодна 64',
        legal_address: 'юр.адрес',
        director: 'Ярополова Ирина',
        tel: '+7(965) 123-00-47',
        email: 'info@trasko.ru',
        foundation: 'дата_основания',
        name: 'Варшава',
        coord: [52.23627004847016, 20.98188446560668]
    },
    {
        address: '170032, Тверь, пос. Власьево, д. 30/1',
        legal_address: 'юр.адрес',
        director: 'Блинов Юрий Анатольевич',
        tel: '+7(965) 123-00-47',
        email: 'info@trasko.ru',
        foundation: 'дата_основания',
        name: 'Тверь',
        coord: [56.79858153010929, 36.038701718246394]
    },
    {
        address: '214533, Смоленск, Смоленская обл., Смоленский р-н., с. Ольша, тер. Восточнее села на расстоянии 500 м Здание Адм. корпуса Северный',
        legal_address: 'юр.адрес',
        director: 'Лебедев Артем Анатольевич',
        tel: '+7(965) 123-00-47',
        email: 'info@trasko.ru',
        foundation: 'дата_основания',
        name: 'Смоленск',
        coord: [54.85397188375832, 31.864757390406506]
    },
    {
        address: '197136, Санкт-Петербург, ул. Лахтинская 16А, офис 12',
        legal_address: 'юр.адрес',
        director: 'Ушкевич Марина Валерьевна',
        tel: '+7(965) 123-00-47',
        email: 'info@trasko.ru',
        foundation: 'дата_основания',
        name: 'Санкт-Петербург',
        coord: [59.96252825962617, 30.300521542327775]
    },
    {
        address: '660135, Красноярск, ул. Взлетная, д.5, стр.1, офис 5',
        legal_address: 'юр.адрес',
        director: 'Белый Сергей Михайлович',
        tel: '+7(965) 123-00-47',
        email: 'info@trasko.ru',
        foundation: 'дата_основания',
        name: 'Красноярск',
        coord: [56.033394568705155, 92.91667549999997]
    },
    {
        address: '344002, Ростов-на-Дону, ул. Социалистическая, д. 74/ А',
        legal_address: 'юр.адрес',
        director: 'Деточкин Михаил Вячеславович',
        tel: '+7(965) 123-00-47',
        email: 'info@trasko.ru',
        foundation: 'дата_основания',
        name: 'Ростов-на-Дону',
        coord: [47.21973500304166, 39.71277000172372]
    }
];

// Старт: Сортировка городов
function sortKey(key) {
    return (a, b) => a[key] > b[key] ? 1 : -1;
}
offices.sort(sortKey('name'));
// Конец